// # Функції

// 1. Напиши функцію, яка приймає два параметри (a і b) та повертає їхню суму.
function toSum(a, b) {
  return a + b;
}
// 2. Напиши функцію, яка приймає три параметри (a, b, c) і повертає максимальне з
//    них.
const getMax = (a, b, c) => Math.max(a, b, c);
// В стрілочних функціях (() => {}) немає об'єкта arguments.

// 3. Напиши функцію, яка приймає три параметри (число, мінімум і максимум) та
//    повертає true, якщо число знаходиться між мінімумом і максимумом (включно), і
//    false, якщо ні.
function between(number, min, max) {
  return number >= min && number <= max;
}
// 4. Напиши функцію, яка приймає рядок і повертає перший символ цього рядка.
function retrieveFirstChar(str) {
  return str[0];
}
// 5. Напиши функцію, яка приймає рядок і повертає останній символ цього рядка.
function retrieveLastChar(str) {
  return str.at(-1); // Сучасний метод .at() підтримує від'ємні індекси
  // або класичний варіант: return str[str.length - 1];
}
// 6. Напиши функцію, яка приймає число і повертає true, якщо число парне, і false,
//    якщо ні.
function isEven(number) {
  return number % 2 === 0;
}
// 7. Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то
//    повернути null, в іншому випадку повернути добуток цих двох чисел.
(a, b) => {
  if (a == 0 || b == 0) {
    return null;
  }
  return a * b;
};
// 8. Напиши функцію яка приймає рядок і повертає цей самий рядок але огорнутий у
//    тег div. Приклад: на вході був рядок `"Hello world"` а на виході рядок
//    `"<div>Hello world</div>"`

// 9. Напиши функцію, яка приймає рядок і повертає кількість слів у ньому (слова
//    розділені пробілами).
// 10. Напиши функцію, яка приймає рядок і повертає його довжину помножену на
//    кількість слів в цьому рядку.
// 11. Напиши функцію, яка приймає рядок і повертає кількість голосних літер у ньому
//    (a, e, i, o, u). Використовуйте метод includes та цикл.
// 12. Напиши функцію, яка приймає рядок і повертає новий рядок, де слова
//    розташовані у зворотному порядку.
// 13. Напиши функцію, яка приймає довільну кількість аргументів і повертає true,
//    якщо всі аргументи є числами, і false, якщо ні.
// 14. Напиши функцію, яка приймає довільну кількість аргументів і повертає їх
//    об'єднаними в один рядок, розділений комами.
// 15. Напиши функцію, яка приймає довільну кількість чисел і повертає їхній
//    добуток.
// 16. Напиши функцію, яка приймає довільну кількість чисел і повертає кількість
//    непарних чисел серед них.
// 17. Напиши функцію яка приймає довільну кількість рядочків і повертає той рядок
//    що є найдовшим
// 18. Напиши функцію яка приймає довільну кількість рядочків і обєднує їх в один
//    цілий рядок.
function intoOneBigStr(...args) {
  return args.join("");
}
